//Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.


let i = 0;
while(i <= 10) {
    console.log(i)
    i++

}




//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let a = 2; a <= 20; a++) {
    if(a % 2 === 0) {

        console.log(a)
    }
}




//Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for(let b = 0; b <= 10; b++) {

    console.log(7 * b)
}



//Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const n = 5;

for(let c = 0; c <= n; c++){
    console.log(c)

}






//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let d = 1



while(d <= 20) {
    if(d % 3 === 0) {
        d++;
        continue

    }
    console.log(d)
    d++


}





